var knowledge = [
  [
    "Электронно-дырочный переход",
    "является",
    "границей между областями полупроводника с электронной и дырочной проводимостью.",
  ],

  [
    "Валентная зона",
    "содержит",
    "электроны, которые могут переходить в зону проводимости при наличии достаточной энергии.",
  ],
  [
    "Примеси",
    "влияют",
    "на электрические свойства полупроводника, определяя его проводимость и электронные характеристики.",
  ],
  [
    "Дырочная проводимость",
    "является",
    "связанной с отсутствием электронов в валентной зоне полупроводника.",
  ],
  [
    "Дрейфовые токи",
    "возникают",
    "из-за электрического поля в области p-n-перехода.",
  ],
  [
    "Высота потенциального барьера",
    "определяется",
    "разностью энергий уровней Ферми в p- и n-областях.",
  ],
  [
    "Энергия Ферми",
    "определяет",
    "уровень заполнения энергетических уровней в p- и n-областях.",
  ],
  [
    "Диффузионные токи",
    "преобладают",
    "в случае пропускной разности потенциалов.",
  ],
];
